"""Практическая работа №1. Линейные программы
Вариант 23
Написать программу, проверяющую, является ли введенное число 
автоморфным. Если число не является автоморфным, проверить является ли 
оно триморфным. 
Входные значения: число.  
Выходные значения: сообщение по результатам проверки."""


from math import floor, log10


def f(x: int) -> None:
    """Сообщает, является ли данное число автоморфным или триморфным."""

    if x < 0:
        print('Не натуральное число не может быть '
        'автоморфным или триморфным по определению.')
        return

    num_len: int = (floor(log10(x)) + 1) if x != 0 else 1
    num_squared: int = x**2
    num_cubed: int = x**3

    if num_squared % 10 ** num_len == x:
        print(f'Число автоморфное, '
              f'так как {num_squared} заканчивается на {x}')
    elif num_cubed % 10 ** num_len == x:
        print(f'Число триморфное, так как {num_cubed} заканчивается на {x}')
    else:
        print('Число не является автоморфным или триморфным')


while True:
    try:
        num: int = int(input('Введите число: '))
        f(num)
    except ValueError:
        print('Введено не число')
